; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob89) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate8)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate11)
	(at pallet5 distributor2)
	(clear crate10)
	(at pallet6 distributor1)
	(clear crate4)
	(at pallet7 distributor1)
	(clear crate6)
	(at pallet8 distributor0)
	(clear pallet8)
	(at pallet9 distributor2)
	(clear crate7)
	(at pallet10 distributor2)
	(clear crate2)
	(at pallet11 distributor0)
	(clear pallet11)
	(at truck0 distributor1)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet9)
	(at crate1 distributor1)
	(on crate1 pallet6)
	(at crate2 distributor2)
	(on crate2 pallet10)
	(at crate3 distributor1)
	(on crate3 crate1)
	(at crate4 distributor1)
	(on crate4 crate3)
	(at crate5 distributor2)
	(on crate5 crate0)
	(at crate6 distributor1)
	(on crate6 pallet7)
	(at crate7 distributor2)
	(on crate7 crate5)
	(at crate8 depot0)
	(on crate8 pallet0)
	(at crate9 distributor1)
	(on crate9 pallet4)
	(at crate10 distributor2)
	(on crate10 pallet5)
	(at crate11 distributor1)
	(on crate11 crate9)
)

(:goal (and
		(on crate0 pallet5)
		(on crate1 pallet1)
		(on crate2 pallet7)
		(on crate3 crate10)
		(on crate4 crate2)
		(on crate5 pallet2)
		(on crate6 pallet8)
		(on crate8 crate6)
		(on crate9 crate8)
		(on crate10 pallet0)
		(on crate11 pallet10)
	)
))

; plan
1. (lift hoist0 crate8 pallet0 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 pallet0)
   added: (lifting hoist0 crate8) (clear pallet0)
   goals met: 0 of 11
2. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 0 of 11
3. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   goals met: 0 of 11
4. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 0 of 11
5. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 0 of 11
6. (drop hoist4 crate8 crate11 distributor1)
   deleted: (lifting hoist4 crate8) (clear crate11)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 crate11)
   goals met: 0 of 11
7. (lift hoist5 crate10 pallet5 distributor2)
   deleted: (at crate10 distributor2) (clear crate10) (available hoist5) (on crate10 pallet5)
   added: (lifting hoist5 crate10) (clear pallet5)
   goals met: 0 of 11
8. (load hoist5 crate10 truck1 distributor2)
   deleted: (lifting hoist5 crate10)
   added: (in crate10 truck1) (available hoist5)
   goals met: 0 of 11
9. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 0 of 11
10. (unload hoist0 crate10 truck1 depot0)
   deleted: (in crate10 truck1) (available hoist0)
   added: (lifting hoist0 crate10)
   goals met: 0 of 11
11. (drop hoist0 crate10 pallet0 depot0)
   deleted: (lifting hoist0 crate10) (clear pallet0)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 pallet0)
   goals met: 1 of 11
12. (lift hoist5 crate7 crate5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 crate5)
   added: (lifting hoist5 crate7) (clear crate5)
   goals met: 1 of 11
13. (drop hoist5 crate7 pallet5 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet5)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet5)
   goals met: 1 of 11
14. (lift hoist5 crate5 crate0 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate0)
   added: (lifting hoist5 crate5) (clear crate0)
   goals met: 1 of 11
15. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 1 of 11
16. (load hoist5 crate5 truck1 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck1) (available hoist5)
   goals met: 1 of 11
17. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 1 of 11
18. (unload hoist2 crate5 truck1 depot2)
   deleted: (in crate5 truck1) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 1 of 11
19. (drop hoist2 crate5 pallet2 depot2)
   deleted: (lifting hoist2 crate5) (clear pallet2)
   added: (available hoist2) (at crate5 depot2) (clear crate5) (on crate5 pallet2)
   goals met: 2 of 11
20. (lift hoist5 crate2 pallet10 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet10)
   added: (lifting hoist5 crate2) (clear pallet10)
   goals met: 2 of 11
21. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 2 of 11
22. (load hoist5 crate2 truck1 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck1) (available hoist5)
   goals met: 2 of 11
23. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 2 of 11
24. (lift hoist4 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 crate3)
   added: (lifting hoist4 crate4) (clear crate3)
   goals met: 2 of 11
25. (load hoist4 crate4 truck1 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck1) (available hoist4)
   goals met: 2 of 11
26. (lift hoist4 crate3 crate1 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 crate1)
   added: (lifting hoist4 crate3) (clear crate1)
   goals met: 2 of 11
27. (load hoist4 crate3 truck1 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck1) (available hoist4)
   goals met: 2 of 11
28. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 2 of 11
29. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 2 of 11
30. (drop hoist0 crate3 crate10 depot0)
   deleted: (lifting hoist0 crate3) (clear crate10)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate10)
   goals met: 3 of 11
31. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 3 of 11
32. (lift hoist5 crate0 pallet9 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet9)
   added: (lifting hoist5 crate0) (clear pallet9)
   goals met: 3 of 11
33. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 3 of 11
34. (drop hoist5 crate0 pallet9 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet9)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet9)
   goals met: 3 of 11
35. (unload hoist1 crate2 truck1 depot1)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 3 of 11
36. (drop hoist1 crate2 pallet1 depot1)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (available hoist1) (at crate2 depot1) (clear crate2) (on crate2 pallet1)
   goals met: 3 of 11
37. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 3 of 11
38. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 3 of 11
39. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 3 of 11
40. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 3 of 11
41. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 3 of 11
42. (lift hoist5 crate0 pallet9 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet9)
   added: (lifting hoist5 crate0) (clear pallet9)
   goals met: 3 of 11
43. (unload hoist1 crate4 truck1 depot1)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 3 of 11
44. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 3 of 11
45. (drop hoist5 crate0 pallet9 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet9)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet9)
   goals met: 3 of 11
46. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 3 of 11
47. (drop hoist0 crate2 crate3 depot0)
   deleted: (lifting hoist0 crate2) (clear crate3)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate3)
   goals met: 3 of 11
48. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 3 of 11
49. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 3 of 11
50. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 3 of 11
51. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 3 of 11
52. (drop hoist0 crate4 crate2 depot0)
   deleted: (lifting hoist0 crate4) (clear crate2)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate2)
   goals met: 4 of 11
53. (lift hoist4 crate8 crate11 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 crate11)
   added: (lifting hoist4 crate8) (clear crate11)
   goals met: 4 of 11
54. (drop hoist4 crate8 crate6 distributor1)
   deleted: (lifting hoist4 crate8) (clear crate6)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 crate6)
   goals met: 5 of 11
55. (lift hoist4 crate11 crate9 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 crate9)
   added: (lifting hoist4 crate11) (clear crate9)
   goals met: 5 of 11
56. (load hoist4 crate11 truck0 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck0) (available hoist4)
   goals met: 5 of 11
57. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 5 of 11
58. (unload hoist5 crate11 truck0 distributor2)
   deleted: (in crate11 truck0) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 5 of 11
59. (drop hoist5 crate11 pallet10 distributor2)
   deleted: (lifting hoist5 crate11) (clear pallet10)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 pallet10)
   goals met: 6 of 11
60. (lift hoist4 crate1 pallet6 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet6)
   added: (lifting hoist4 crate1) (clear pallet6)
   goals met: 6 of 11
61. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 6 of 11
62. (load hoist4 crate1 truck1 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck1) (available hoist4)
   goals met: 6 of 11
63. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 6 of 11
64. (unload hoist1 crate1 truck1 depot1)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 6 of 11
65. (drop hoist1 crate1 pallet1 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 depot1) (clear crate1) (on crate1 pallet1)
   goals met: 7 of 11
66. (lift hoist4 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 crate6)
   added: (lifting hoist4 crate8) (clear crate6)
   goals met: 6 of 11
67. (drop hoist4 crate8 pallet6 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet6)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet6)
   goals met: 6 of 11
68. (lift hoist4 crate6 pallet7 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 pallet7)
   added: (lifting hoist4 crate6) (clear pallet7)
   goals met: 6 of 11
69. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 6 of 11
70. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   goals met: 6 of 11
71. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 6 of 11
72. (unload hoist3 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist3)
   added: (lifting hoist3 crate6)
   goals met: 6 of 11
73. (drop hoist3 crate6 pallet8 distributor0)
   deleted: (lifting hoist3 crate6) (clear pallet8)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 pallet8)
   goals met: 7 of 11
74. (lift hoist4 crate8 pallet6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 pallet6)
   added: (lifting hoist4 crate8) (clear pallet6)
   goals met: 7 of 11
75. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 7 of 11
76. (load hoist4 crate8 truck1 distributor1)
   deleted: (lifting hoist4 crate8)
   added: (in crate8 truck1) (available hoist4)
   goals met: 7 of 11
77. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 7 of 11
78. (unload hoist3 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 7 of 11
79. (lift hoist4 crate9 pallet4 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 pallet4)
   added: (lifting hoist4 crate9) (clear pallet4)
   goals met: 7 of 11
80. (drop hoist3 crate8 pallet3 distributor0)
   deleted: (lifting hoist3 crate8) (clear pallet3)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 pallet3)
   goals met: 7 of 11
81. (lift hoist5 crate0 pallet9 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet9)
   added: (lifting hoist5 crate0) (clear pallet9)
   goals met: 7 of 11
82. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   goals met: 7 of 11
83. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 7 of 11
84. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   goals met: 7 of 11
85. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 7 of 11
86. (unload hoist3 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist3)
   added: (lifting hoist3 crate9)
   goals met: 7 of 11
87. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 7 of 11
88. (load hoist3 crate9 truck1 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck1) (available hoist3)
   goals met: 7 of 11
89. (lift hoist0 crate4 crate2 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate2)
   added: (lifting hoist0 crate4) (clear crate2)
   goals met: 6 of 11
90. (lift hoist3 crate8 pallet3 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 pallet3)
   added: (lifting hoist3 crate8) (clear pallet3)
   goals met: 6 of 11
91. (load hoist3 crate8 truck1 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck1) (available hoist3)
   goals met: 6 of 11
92. (unload hoist3 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist3)
   added: (lifting hoist3 crate9)
   goals met: 6 of 11
93. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 6 of 11
94. (drop hoist3 crate9 pallet11 distributor0)
   deleted: (lifting hoist3 crate9) (clear pallet11)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 pallet11)
   goals met: 6 of 11
95. (drop hoist0 crate4 crate2 depot0)
   deleted: (lifting hoist0 crate4) (clear crate2)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate2)
   goals met: 7 of 11
96. (lift hoist3 crate9 pallet11 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 pallet11)
   added: (lifting hoist3 crate9) (clear pallet11)
   goals met: 7 of 11
97. (unload hoist1 crate8 truck1 depot1)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 7 of 11
98. (drop hoist1 crate8 crate1 depot1)
   deleted: (lifting hoist1 crate8) (clear crate1)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 crate1)
   goals met: 7 of 11
99. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 7 of 11
100. (load hoist3 crate9 truck0 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck0) (available hoist3)
   goals met: 7 of 11
101. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 7 of 11
102. (lift hoist1 crate8 crate1 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 crate1)
   added: (lifting hoist1 crate8) (clear crate1)
   goals met: 7 of 11
103. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 7 of 11
104. (unload hoist1 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   goals met: 7 of 11
105. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 7 of 11
106. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 7 of 11
107. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   goals met: 7 of 11
108. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 7 of 11
109. (load hoist1 crate9 truck1 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   goals met: 7 of 11
110. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 7 of 11
111. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 7 of 11
112. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 7 of 11
113. (drop hoist3 crate8 crate6 distributor0)
   deleted: (lifting hoist3 crate8) (clear crate6)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 crate6)
   goals met: 8 of 11
114. (lift hoist0 crate4 crate2 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate2)
   added: (lifting hoist0 crate4) (clear crate2)
   goals met: 7 of 11
115. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 7 of 11
116. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 7 of 11
117. (unload hoist3 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist3)
   added: (lifting hoist3 crate9)
   goals met: 7 of 11
118. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 7 of 11
119. (drop hoist3 crate9 crate8 distributor0)
   deleted: (lifting hoist3 crate9) (clear crate8)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 crate8)
   goals met: 8 of 11
120. (lift hoist0 crate2 crate3 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate3)
   added: (lifting hoist0 crate2) (clear crate3)
   goals met: 8 of 11
121. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   goals met: 8 of 11
122. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 8 of 11
123. (unload hoist4 crate2 truck1 distributor1)
   deleted: (in crate2 truck1) (available hoist4)
   added: (lifting hoist4 crate2)
   goals met: 8 of 11
124. (drop hoist4 crate2 pallet7 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet7)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 pallet7)
   goals met: 9 of 11
125. (unload hoist4 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 9 of 11
126. (drop hoist4 crate4 crate2 distributor1)
   deleted: (lifting hoist4 crate4) (clear crate2)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 crate2)
   goals met: 10 of 11
127. (drop hoist5 crate0 pallet9 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet9)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet9)
   goals met: 10 of 11
128. (lift hoist5 crate7 pallet5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet5)
   added: (lifting hoist5 crate7) (clear pallet5)
   goals met: 10 of 11
129. (drop hoist5 crate7 crate11 distributor2)
   deleted: (lifting hoist5 crate7) (clear crate11)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 crate11)
   goals met: 10 of 11
130. (lift hoist5 crate0 pallet9 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet9)
   added: (lifting hoist5 crate0) (clear pallet9)
   goals met: 10 of 11
131. (drop hoist5 crate0 pallet5 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet5)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet5)
   goals met: 11 of 11
